Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Instead of manually starting two (or more) containers, you can also create a Docker Compose configuration script, which automatically starts and configures a Flink clus‐ ter running in Docker containers and possibly other services such as ZooKeeper and Kafka.
zh_cn: 除了手工启用两个（或更多）容器之外，你还可以创建一个Docker Compose配置脚本。它支持自动启动和配置运行在Docker容器内的Flink集群，还可以顺带启用诸如ZooKeeper和Kafka等其他服务。

source: Instead of running analytical queries directly on the transactional databases, a com‐ mon component in IT systems is a data warehouse.
zh_cn: IT系统中一般会选用的数据仓库，而非事务型数据库来执行分析类查询。

source: Instead of running analytical queries directly on the transactional databases, the data is typically replicated to a data warehouse, a dedicated datastore for analytical query workloads.
zh_cn: 对于分析类查询，我们通常不会直接在事务型数据库上执行，而是将数据复制到一个专门用来处理分析类查询工作的数据仓库。

source: Instead of trying to strictly measure latency for each and every event, it approximates latency by periodically emitting a special record at the sources and allowing users to track how long it takes for this record to arrive at the sinks.
zh_cn: 它没有严格测量每个事件的延迟，而是通过在数据源周期性地发出一些特殊记录并允许用户跟踪它们到达数据汇的时间来近似估计延迟。

source: Instead of using a SerializationSchema to convert records into byte arrays, you can also specify a KeyedSerializationSchema, which serializes a record into two byte arrays—one for the key and one for the value of a Kafka message.
zh_cn: 除了使用SerializationSchema将记录转换成字节数组，你还可以选用KeyedSerializationSchema，它会将一条记录序列化成两个字节数组，分别作为kafka消息的键和值。

source: Instead of waiting for the application to terminate, the client returns and prints the JobID of the submitted job.
zh_cn: 此时客户端不会再等应用结束，而会立即返回并打印提交作业的JobID。

source: Instead of waiting to be periodically trig‐ gered, a streaming analytics application continuously ingests streams of events and maintains an updating result by incorporating the latest events with low latency.
zh_cn: 流式分析应用不再需要等待周期性地触发。相反，它们会一直获取事件流，以极低的延迟整合最新事件，从而可以维护不断更新的结果。

source: Instead of waiting to be periodically triggered, a streaming analytics application con‐ tinuously ingests streams of events and updates its result by incorporating the latest events with low latency.
zh_cn: 流式分析应用不再需要等待周期性地触发。相反，它会持续获取事件流，以极低的延迟整合最新事件，从而可以不断更新结果。

source: Instead, Flink implements checkpointing based on the Chandy–Lamport algorithm for distributed snapshots.
zh_cn: 而Flink的检查点是基于Chandy-Lamport分布式快照算法来实现的。

source: Instead, Flink is bundled as a library together with the application in a container image.
zh_cn: 而是以库的形式绑定在应用所在的容器镜像中。

source: Instead, Flink organizes keys in so-called key groups.
zh_cn: 而是会把所有键值分为不同的键值组。

source: Instead, Flink uses a lightweight snapshotting mechanism to achieve exactly-once result guarantees.
zh_cn: Flink采用了轻量级检查点机制来实现精确一次结果保障。

source: Instead, POJOs are handed to Cassandra’s Object Mapper, which automatically maps POJO fields to fields of a Cassandra table.
zh_cn: 事实上，POJO对象会交给Cassandra的Object Mapper来处理，它会自动把POJO字段映射到Cassandra表中的字段。

source: Instead, a 95th-percentile latency value of 10ms means that 95% of events are processed within 10ms.
zh_cn: 而第95百分位延迟在10毫秒意味着95%的事件会在10毫秒内处理。

source: Instead, a method is called as soon as an event has arrived via the corre‐
zh_cn: 一旦对应流中有事件到来，系统就需要调用相应的方法。

source: Instead, all stateful operators must control the size of their state and have to ensure it is not infinitely growing.
zh_cn: 所有状态化算子都要控制自身状态大小，确保他们不会无限制增长。

source: Instead, every system features its own connector library with a proprietary protocol.
zh_cn: 它们每一个都要用到自己专有协议的连接器库。

source: Instead, functions implement operator state as regular member variables and interact with the state backend via callback functions of the ListCheckpointed interface.
zh_cn: 而需要将算子状态实现为成员变量并通过接口提供的回调函数和状态后端进行交互。

source: Instead, it focuses on its core function - distributed data stream processing - and leverages existing cluster infra‐ structure and services.
zh_cn: 而是在已有集群基础设施和服务之上专注于它的核心功能——分布式数据流处理。

source: Instead, it focuses on its core function—distributed data stream processing—and leverages existing cluster infra‐ structure and services.
zh_cn: 而是在已有集群基础设施和服务之上专注于它的核心功能——分布式数据流处理。

source: Instead, it is crucial that the stream processing system provides some mechanism to deal with events that might arrive after the watermark.
zh_cn: 而流处理系统至关重要的一点是能提供一些机制来处理那些可能晚于流水线的落后事件。

source: Instead, it is crucial that the stream pro‐ cessing system provide some mechanism to deal with events that might arrive after the watermark.
zh_cn: 而流处理系统很关键的一点是能提供某些机制来处理那些可能晚于水位线的落后事件。

source: Instead, it takes advantage of distributed filesystems like HDFS or object stores such as S3.
zh_cn: 而是利用了现有的分布式文件系统（如HDFS）或对象存储（如S3）。

source: Instead, keys are defined as functions over the input data.
zh_cn: 而是将它定义为输入数据上的函数。

source: Instead, streaming applications must provide results for incoming data as fast as possible while being able to handle high ingest rates of events.
zh_cn: 取而代之的是，流式应用必须尽可能快地针对到来数据计算结果，且需要应对较高的事件接入速率。

source: Instead, the API calls construct an execution plan in the execution environment, which consists of the stream sources created from the environment and all transformations that were tran‐
zh_cn: 而只会在执行环境中构建一个执行计划。计划中包含了从环境创建的流式数据源以及应用于这些数据源之上的一系列转换。

source: Instead, the SessionWindows assigner initially maps each incoming element into its
zh_cn: 事实上，SessionWindows分配器会将每个到来的元素映射到一个它自己的窗口中。

source: Instead, the context of the KeyedBroadcastProcessFunction.processBroad castElement() method provides a method applyToKeyed State(StateDescriptor,
zh_cn: 作为替代，该方法的上下文提供了一个applyToKeyedState(StateDescriptor, KeyedStateFunction)方法，

source: Instead, the operator continues to maintain the complete window for the allowed lateness period.
zh_cn: 而是会将窗口继续保留该延迟容忍度的时间。

source: Instead, the source and sink connectors of an application need to be integrated with Flink’s checkpointing and recovery mecha‐ nism and provide certain properties to be able to give meaningful guarantees.
zh_cn: 进一步，应用的数据源和数据汇连接器需要和Flink的检查点及恢复策略集成，并能提供某些特定的属性以支持各类有意义的保障。

source: Instead, time-based DataStream operator tasks configure the time‐ stamps of emitted records to ensure they are properly aligned with the emitted watermarks.
zh_cn: 为发出记录配置时间戳的工作需要由基于时间的DataStream算子任务来完成，这样才能确保时间戳和发出的水位线对齐。

source: Instead, we need a window operation that assigns events belonging to the same session in the same bucket.
zh_cn: 而我们需要一个窗口操作，能将属于同一会话的事件分配到相同桶中。

source: Instead, what really defines the amount of events in one minute is the time of the data itself.
zh_cn: 而事实上每分钟收到事件数目的是由数据本身的时间来定义的。

source: Instead, you can implement the necessary logic using the building blocks of record timestamps, watermarks, and timers.
zh_cn: 虽然如此，你仍可以利用记录时间戳、水位线和定时器等功能来实现必要的迟到数据处理逻辑。

source: Instead, you need to build a cus‐ tom image that either “hardcodes” the required parameters or is flexible enough to adjust the configuration dynamically through parameters or environment variables.
zh_cn: 为此，你需要构建一个自定义镜像，要么就把所需参数"硬编码"进去，要么就灵活一些，允许通过参数或环境变量动态调整配置。

source: Integration with Hadoop Components
zh_cn: 集成Hadoop组件

source: Internally, Flink needs to be able to handle these objects.
zh_cn: 因此Flink在内部需要对这些数据对象进行一些处理。

source: Internally, a window that is evaluated by ProcessWindowFunction stores all assigned events in a ListState.1 By collecting all events and providing access to window meta‐ data and other features, ProcessWindowFunction can address many more use cases than ReduceFunction or AggregateFunction.
zh_cn: 在系统内部，由ProcessWindowFunction处理的窗口会将所有已分配的事件存储在ListState中。1 通过将所有事件收集起来且提供对于窗口元数据及其他一些特性的访问和使用，ProcessWindowFunction的应用场景比ReduceFunction和AggregateFunction更加广泛。

source: Interval Join
zh_cn: 基于间隔的Join

source: Introduction to Dataflow Programming
zh_cn: Dataflow编程介绍

source: Introduction to Dataflow Programming | 19
zh_cn: Dataflow编程介绍 | 19

source: Introduction to Stateful Stream Processing
zh_cn: 状态化流处理介绍

source: Introduction to Stateful Stream Processing.
zh_cn: 状态化流处理介绍

source: Introduction to dataflow programming
zh_cn: dataflow模型介绍

source: Inversely, very conservative water‐ marks increase processing latency but improve result completeness.
zh_cn: 相反，非常宽松的水位线会增加处理延迟，但同时结果的完整性也会有所提升。

source: It also gives you a brief look at what it is like to run your first streaming application on a local Flink instance.
zh_cn: 此外还简要介绍了如何在本地Flink实例上运行你的第一个流式应用。

source: It also gives you a brief taste of what it is like to run a your first streaming application on a local Flink instance.
zh_cn: 此外还简要介绍了如何在本地Flink实例上运行你的第一个流处理应用。

source: It also includes a set of common graph algorithms ready to use.
zh_cn: 它还涵盖了一组方便使用的常见图算法。

source: It also needs to provide a default trigger
zh_cn: 它还需要一个默认触发器，

source: It also offers basic functionality to submit and manage applications.
zh_cn: 它同时提供了基本的应用提交和管理功能。

source: It also shows how to use Flink’s queryable state.
zh_cn: 同时本章还会展示如何使用Flink的可查询式状态。

source: It also supports connecting a keyed and
zh_cn: 它不仅支持联结一个按键值分好区的流和一个广播流，还能将广播后的事件存到一个托管状态（managed state）中。

source: It applies a ReduceFunction on a KeyedStream, which combines each incoming event with the current reduced value, and produces a DataStream.
zh_cn: 它将一个ReduceFunction应用在一个KeyedStream上，每个到来事件都会和reduce结果进行一次组合，从而产生一个新的DataStream。

source: It builds on top of the DataSet API and Flink’s support for efficient batch iterations.
zh_cn: 它建立在DataSet API和Flink的高效批量迭代支持之上。

source: It can be accessed by users and scripts and provides access to all system and application metrics as well as endpoints to submit and manage appli‐ cations.
zh_cn: 它可以供用户或脚本访问，还可用于获取所有系统及应用指标并作为提交和管理应用的端点。

source: It can be configured to preserve the order of records (requests might
zh_cn: 它可以通过配置选择对记录进行保序（请求结果的返回顺序可能和请求发出的顺序不同），

source: It can be used to generate watermarks that are encoded in special input records.
zh_cn: 它可用于需要根据特殊输入记录生成水位线的情况。

source: It can remove elements from a window before or after the window function is evaluated.
zh_cn: 它可以用于在窗口执行计算前或后从窗口中删除元素。

source: It consists of 11 chapters that hopefully tell a coherent story.
zh_cn: 它总共包含了11个章节，我们希望通过这些章节讲述一个完整的故事。

source: It consists of 11 chapters which hopefully tell a coherent story.
zh_cn: 它包含了11个章节，我们希望通过这些章节讲述一个完整的故事。

source: It consists of a subdirectory that holds the data files containing the states of all tasks and a binary metadata file that includes absolute paths to all data files.
zh_cn: 它由一个包含了所有任务状态数据文件的子目录和一个包含了全部数据文件绝对路径的二进制元数据文件组成。

source: It consists of three operators that are all configured for a task parallelism of two and are connected with local forward connec‐ tions.
zh_cn: 它包含了3个算子，每个算子的任务并发度都为2且通过本地转发方式连接。

source: It consists of three operators that are all configured for a task parallelism of two and connected with local forward connec‐ tions.
zh_cn: 它包含了3个算子，每个算子的任务并行度都为2且通过本地转发方式连接。

source: It defines the checkAndGetNextWatermark() method, which is called for each event right after extractTimestamp().
zh_cn: 该接口中的checkAndGetNextWatermark()方法会在针对每个事件的extractTimestamp()方法后立即调用。

source: It defines the map() method that trans‐ forms an input event into exactly one output event:
zh_cn: 该接口的map()方法将每个输入事件转换为一个输出事件：

source: It determines how much the operator’s process‐ ing effort can be distributed and also how much data it can process.
zh_cn: 它决定了算子处理的并行化程度以及能够处理的数据规模。

source: It discusses Flink’s approach to end-to-end application consistency and how to implement custom connectors to ingest data from and emit data to external systems.
zh_cn: 其中会讨论Flink中解决端到端应用一致性的方案以及如何实现自定义连接器来读写外部系统。

source: It discusses distributed architecture, time and state handling in streaming applications, and Flink’s fault toler‐ ance mechanisms.
zh_cn: 其中讨论了分布式架构、流式应用中的时间和状态处理问题、Flink的容错机制。

source: It discusses dis‐ tributed architecture, time and state handling in streaming applications, and Flink’s fault-tolerance mechanisms.
zh_cn: 其中讨论了分布式架构、流式应用中的时间和状态处理问题以及Flink的容错机制。

source: It divides an input stream into two or more output streams of the same type as the input stream.
zh_cn: 它将输入流分割成两条或多条类型和输入流相同的输出流。

source: It efficiently runs such applica‐ tions at large scale in a fault-tolerant manner.
zh_cn: 且支持在容错的前提下高效运行大规模的此类应用。

source: It emits one record for each window consisting of the
zh_cn: 每个窗口都会发出一条记录，

source: It exposes methods to retrieve the window boundaries, to check whether windows intersect, and to merge overlapping windows.
zh_cn: 它对外提供了获取窗口边界、检查窗口是否相交以及合并重叠窗口等方法。

source: It gives access to the timestamp and the key of the current record and to a TimerService.
zh_cn: 你可以通过它访问时间戳、当前记录的键值以及TimerService。

source: It has a public constructor without any arguments—a default constructor.
zh_cn: 有一个公有的无参默认构造函数。

source: It has been a long journey and you have made it to the end of this book!
zh_cn: 漫长的旅途过后，你已到达本书的尾章！

source: It is a hybrid of EventTime and ProcessingTime.
zh_cn: IngestionTime是EventTime和ProcessingTime的混合体，

source: It is a public class.
zh_cn: 是一个公有类。

source: It is also possible to configure an application to retain its last checkpoint when it is canceled.
zh_cn: 可以通过配置让应用在取消的时候保留最近一次检查点。

source: It is also possible to explicitly create local or remote execution environments as fol‐ lows:
zh_cn: 同时你也可以像下面这样显式指定本地或远程执行环境：

source: It is also possible to nest expressions on mixed types.
zh_cn: 你还能够在混合类型上嵌套表达式。

source: It is also possible to specify a custom trigger and evictor.
zh_cn: 同时你也可以自定义触发器或移除器。

source: It is also possible to start a new chain with an operator by calling its startNewChain()
zh_cn: 你还可以调用startNewChain()方法为算子开启一个新的链接（示例10-2）。

source: It is best practice to assign timestamps and generate watermarks as close to the sour‐ ces as possible or even within the SourceFunction.
zh_cn: 最佳做法就是在尽可能靠近数据源的地方，甚至是SourceFunction内部，分配时间戳并生成水位线。

source: It is called once per task before a transformation method like filter or map is called.
zh_cn: 它在每个任务调用正式的转换方法（如filter或map）前调用一次。

source: It is common that companies store the same data in multiple different systems to improve the performance of data accesses.
zh_cn: 公司为了提高数据访问性能把相同数据存储到多个系统中已然非常普遍。

source: It is crucial to understand how to deliver accu‐ rate and deterministic results under such conditions.
zh_cn: 了解如何在这种情况下提供精准、确定的结果就变得至关重要。

source: It is crucial to understand how you can deliver accurate and deterministic results under such conditions.
zh_cn: 了解如何在这种情况下提供精准、确定的结果就变得至关重要。

source: It is implemented on top of the DataStream API and lets you specify patterns you want to detect in your stream.
zh_cn: 它基于DataStream API实现，允许你指定在数据流中期望检测到的模式。

source: It is important to note that a window is created when the first element is assigned to it.
zh_cn: 请注意，窗口会随着系统首次为其分配元素而创建，

source: It is important to note that sometimes you can
zh_cn: 注意，有时候可以通过弱保障实现强语义。

source: It is important to note that sometimes you can get stronger semantics with weaker guarantees.
zh_cn: 注意，有时候你可以通过弱保障来实现强语义。

source: It is important to note that the rate of processing depends on the rate of arrival; low throughput does not necessarily indicate bad performance.
zh_cn: 但要注意，处理速率取决于数据到来速率，因此吞吐低不一定意味着性能差。

source: It is important to point out that an AsyncFunction instance is sequentially called for each of its input records—a function instance is not called in a multithreaded fashion.
zh_cn: 需要指出的一点是，AsyncFunction实例会按照它输入记录的顺序被串行调用。换句话说，对于函数实例本身的调用不涉及任何多线程操作。

source: It is important to understand that the initial design of an applica‐ tion determines if and how it can be modified later on in a savepoint-compatible way.
zh_cn: 请谨记，应用的初始设计决定了它日后能否、或以何种方式进行保存点兼容的修改。

source: It is installed by moving the swift-connector JAR file from the ./opt to the ./lib folder.
zh_cn: 你可以通过将swift-connector JAR文件从./opt中移动到./lib目录来安装它。

source: It is not accessible while the application is restarted due to an error, for rescaling the application, or to migrate it to another cluster.
zh_cn: 如果应用正在因为错误而重启、正在进行扩缩容或正在迁移至其他集群，那么可查询式状态将无法访问。

source: It is not part of Flink’s binary distributions.
zh_cn: 但该脚本没有包含在Flink的二进制发行版中。

source: It is not possible to clean up state in a timer callback method, since these methods are not called after a window is
zh_cn: 由于在删除窗口后不会调用计时器回调方法，所以无法在其中清理状态。

source: It is not possible to combine multiple rolling aggregation methods—only a single roll‐ ing aggregate can be computed at a time.
zh_cn: 注意，你无法将多个滚动聚合方法组合使用，每次只能计算一个。

source: It is not possible to control the order in which the methods of a CoMapFunction or CoFlatMapFunction are called.
zh_cn: CoMapFunction和CoFlatMapFunction内方法的调用顺序无法控制。

source: It is not possible to customize the configuration of the Flink deployment with the Flink Docker images we used in this section.
zh_cn: 本节中使用的Flink Docker镜像是无法进行自定义部署配置的。

source: It is not possible to request key ranges or even run more complex queries.
zh_cn: 而不支持键值范围或更复杂的条件查询。

source: It is not possible to start an application from a previously taken savepoint if the identi‐ fiers or the maximum parallelism of operators were changed.
zh_cn: 如果新应用中这两个参数发生了变化，则无法从之前生成的保存点启动。

source: It is not possible to store the commit information in Flink’s application state because it is not persistent and would be reset in case of a failure.
zh_cn: 检查点已提交的信息无法存储在Flink的应用状态中，因为状态本身并不具有持久性，并且会在发生故障时重置。

source: It is not pos‐ sible to remove individual elements from ListState, but the list can be updated by calling ListState.update(values: java.util.List[T]).
zh_cn: 虽然ListState不支持删除单个元素，但你可以调用ListState.update(values: java.util.List[T])来更新整个列表，

source: It is not surprising that using a DoubleSer ializer to deserialize the binary data generated by serializing a String with a StringSerializer will fail.
zh_cn: 毫无疑问，使用DoubleSerializer去反序列化一个由StringSerializer序列化的二进制String数据一定会失败。

source: It is not uncommon for a streaming job to be continuously running for months, so its operational needs are quite different than those of short-lived batch jobs.
zh_cn: 流式作业长年累月运行的情况并不少见，因此其运维需求和短期批处理作业大不相同。

source: It is often necessary to fix a bug or to evolve the business logic of a long-running stateful streaming application.
zh_cn: 很多时候我们需要对一个长时间运行的状态化流式应用进行Bug修复或业务逻辑调整。

source: It is possible to assign operators to different slot-sharing groups and thus assign their tasks to distinct slots.
zh_cn: 也可以将算子分配到不同的处理槽共享组（slot-sharing group），从而实现将其任务分配到不同处理槽上。

source: It is pos‐ sible that a task misses the notification.
zh_cn: 所以说任务可能会错过一些通知。

source: It is required by any non-trivial computa‐ tion.
zh_cn: 任何稍麻烦点的计算都用得到它。

source: It is required by any nontrivial computation.
zh_cn: 任何一个稍复杂的计算都要用它。

source: It manages compute resources of a cluster environment—CPU and memory of the cluster’s machines— and provides them to applications that request resources.
zh_cn: 它负责管理集群环境下的计算资源——集群机器的CPU和内存，并将它们提供给请求资源的应用。

source: It offers com‐ mon operators to write relational queries including selection, projection, aggrega‐ tions, and joins and further has IDE support for autocompletion and syntax validation.
zh_cn: 它提供了通用的算子来完成关系型查询，包括选择、投影、聚合及连接，此外还支持IDE自动补全和语法验证。

source: It offers different types of state primitives and supports pluggable state backends.
zh_cn: 它提供了多种类型的状态原语，还支持可插拔的状态后端。

source: It passes each incoming event to a user-defined mapper
zh_cn: 该转换将每个到来的事件传给一个用户自定义的映射器（user-defined mapper），后者针对每个输入只会返回一个（可能类型发生改变的）输出事件。

source: It provides accurate stream processing with high throughput and low latency at scale.
zh_cn: 它支持精确的流处理，能同时满足各种规模下对高吞吐和低延迟的要求，

source: It provides hooks to register and maintain keyed state and operator state
zh_cn: 它为键值分区状态和算子状态分别提供了用于注册及维护的钩子函数（hook），

source: It provides the system with the necessary information it needs to generate serialiazers and comparators.
zh_cn: 它为系统生成序列化器和比较器提供了必要的信息。

source: It reads its configuration from the ./conf/flink-conf.yaml file (see “System Configuration”).
zh_cn: 它会从./conf/flink-conf.yaml文件中（见"系统配置"一节）读取配置。

source: It remembers the rules in an operator state in order to apply them to all events of the event stream.
zh_cn: 它会将规则存为算子状态然后将它们应用到事件流中的全部事件上。

source: It requests processing slots from the ResourceManager to continue executing the application.
zh_cn: 向ResourceManager申请处理槽来继续执行应用。

source: It requests the storage locations from ZooKeeper to fetch the JobGraph, the JAR file, and the state handles of the last checkpoint of the application from the remote storage.
zh_cn: 向ZooKeeper请求存储位置，以获取JobGraph、JAR文件及应用最新检查点在远程存储的状态句柄。

source: It restarts the application and resets the state of all its tasks to the last completed checkpoint.
zh_cn: 重启应用并利用最近一次检查点重置任务状态。

source: It should be noted an application that relies on idempotent sinks to achieve exactly- once results must guarantee that it overrides previously written results while it replays.
zh_cn: 注意，依赖于幂等性数据汇的应用为了实现精确一次的结果，需要保证在重放时可以覆盖之前写出的结果。

source: It should be noted that joining windowed streams can have unex‐ pected semantics.
zh_cn: 注意，对划分窗口后的数据流进行Join可能会产生意料之外的语义。

source: It starts the same application with the same configuration on the same cluster.
zh_cn: 它会在完全相同的集群上，以完全相同的配置，运行完全相同的应用。

source: It takes care of updating the routing when a pod is started on a different node in the cluster.
zh_cn: 它在Pod从集群内另一个节点启动时负责更新路由。

source: It then starts to consume and process all data that was processed between the checkpoint and the failure.
zh_cn: 随后应用就会重新消费并处理那些从之前检查点完成开始，到发生系统故障之间已经处理过的数据。

source: It uses FileCheckpointCommitter, which we do not discuss here.
zh_cn: 它用到的FileCheckpointCommitter我们不在此讨论。

source: It will help you to understand Flink’s internals and to reason about the performance and behavior of streaming applications.
zh_cn: 这将帮助你理解Flink的内部原理，评估流式应用的性能及行为。

source: It will help you to understand Flink’s internals and to reason about the perfor‐ mance and behavior of streaming applications.
zh_cn: 这将帮助你在理解Flink内部原理的同时，评估流式应用的性能及行为。

source: It will show that a single Task Manager (Flink’s worker processes) is connected and that a single Task Slot (resource units provided by a Task Manager) is available.
zh_cn: 它表示已经连接上一个Task Manager（Flink的工作进程），且有一个可用的Task Slot（Task Manager所提供的资源单元）。

source: It will show that a single TaskManager (Flink’s worker processes) is connected and that a single task slot (resource units provided by a TaskManager) is available.
zh_cn: 它表示已经连接上一个TaskManager（Flink的工作进程），且有一个可用的任务槽（TaskManager所提供的资源单元）。

source: Iterable over all records of a checkpoint, the ID of the checkpoint, and the time‐ stamp of when the checkpoint was taken.
zh_cn: 该方法接收的参数为针对检查点对应全部记录的Iterable对象，检查点ID，以及检查点的生成时间。

source: Its built-in operators interpret the Long value as a Unix timestamp with millisecond pre‐ cision—the number of milliseconds since 1970-01-01-00:00:00.000.
zh_cn: 内置算子会将这个Long值解析为毫秒精度的Unix时间戳（自1970-01-01-00:00:00.000以来的毫秒数）。

source: Its built-in operators interpret the long value as a Unix timestamp with millisecond precision, i.e., the number of milliseconds since 1970-01-01-00:00:00.000.
zh_cn: 它的内置算子会将这个long类型值解析为毫秒精度的Unix时间戳（自1970-01-01-00:00:00.000以来的毫秒数）。

source: Its core is a distributed publish- subscribe messaging system that is widely adopted to ingest and distribute event streams.
zh_cn: 它的核心是一个分布式的发布/订阅消息系统，该系统被广泛用于获取和分发事件流。

source: Its default trigger is the NeverTrigger that, as the name suggests, never fires.
zh_cn: 它默认的触发器是NeverTrigger，顾名思义，该触发器永远不会触发。

source: Its goal is to introduce the funda‐ mental concepts of stream processing and discuss the requirements of stream pro‐ cessing frameworks.
zh_cn: 其目的在于介绍流处理的基础概念，讨论流处理框架的需求。

source: Java and Classloading
zh_cn: Java和类加载

source: Java and Scala tuples
zh_cn: Java和Scala元组

source: Job recovery from a master failure requires a highly available setup as dis‐ cussed later in this chapter.
zh_cn: 从主进程中的故障中恢复作业需要进行高可用设置，我们会在本章后面讨论它。

source: Job:
zh_cn: 作业：

source: JobManager and job
zh_cn: JobManager及作业

source: JobManager failures
zh_cn: JobManager故障

source: JobManager initiates a checkpoint by sending a message to all sources
zh_cn: JobManager通过向所有数据源发送消息来启动检查点生成流。
